app/Http/Controllers/Member/CrawlerItemsController.php

select * from `crawler_tasks` where `member_id` = 5 and `crawler_tasks`.`ct_id` = '1' limit 1
---
    public function toggle(Request $request){

        $data = $request->all();

        $ci_id = $data['ci_id'];
        $crawlerItem = CrawlerItem::find($ci_id);
        $pivot = $crawlerItem->crawlerTask()->wherePivot('ct_i_id', $data['ct_i_id'])->first()->pivot;

update `crawler_tasks` set `description` = '', `created_at` = '2020-03-26 11:25:11' where `ct_id` = 1
---
    public function save_cralwertask_info()
    {
        $crawlerTask = $this->crawlerService->crawlerTaskRepo->builder()
            ->where('member_id', Auth::guard('member')->user()->id)->find(request()->crawlerTask);
        if($crawlerTask) {
            $crawlerTask->description = request()->description;
            $crawlerTask->save();