app/Http/Controllers/Member/CrawlerTasksController.php

update `crawler_tasks` set `crawler_tasks`.`updated_at` = '' where `member_id` = 5
---
    public function update(CrawlerTaskRequest $request, CrawlerTask $crawlerTask)
    {
        $this->authorize('update', $crawlerTask);
        $data = $request->all();
        $TF = $this->crawlerTaskService->update($crawlerTask,$data);