app/Services/Member/CrawlerTaskService.php

select * from `crawler_tasks` where `member_id` = 5 limit 10 offset 0
select * from `members` where `members`.`id` in (5)
select count(*) as aggregate from `crawler_tasks` where `member_id` = 5
---
    public function index()
    {
        $crawlerTasks = $this->crawlertaskRepo->builder()
            ->where('member_id', Auth::guard('member')->user()->id)
            ->with(['member'])->paginate(10);

update `crawler_tasks` set `ct_name` = 'Jung Chou Kuxx', `description` = 'xx', `created_at` = '2020-03-25 22:06:12' where `ct_id` = 1
---
    public function update($model,$data)
    {
        $crawlerTask = $model;
        return $crawlerTask->update($data);