app/Http/Controllers/Admin/AdminUsersController.php

    public function index(){
        $users = User::withCount(['userLogs'])->paginate(10);
---
select count(*) as aggregate from `users`